1. Положительное или отрицательное число
Напишите программу, которая проверяет, является ли введённое число положительным, отрицательным или нулём.
 2. Чётное или нечётное число
Напишите программу, которая проверяет, является ли введённое число чётным или нечётным.
 3. Наибольшее из трёх чисел
Напишите программу, которая находит наибольшее из трёх введённых чисел.
 4. Делится на 3 или 5
Напишите программу, которая проверяет, делится ли число на 3, на 5, или на оба.
 5. Проверка возраста
Напишите программу, которая проверяет, может ли пользователь участвовать в голосовании, если его возраст больше или равен 18.
 6. Проверка буквы
Напишите программу, которая проверяет, является ли введённый символ гласной (a, e, i, o, u) или согласной.
 7. Кратность двум числам
Напишите программу, которая проверяет, делится ли число одновременно на 3 и на 7.
 8. Число в диапазоне
Напишите программу, которая проверяет, находится ли введённое число в диапазоне от 10 до 100 включительно.
 9. Четное и положительное
Напишите программу, которая проверяет, является ли введённое число одновременно чётным и положительным.
 10. Пароли
Напишите программу, которая запрашивает пароль. Если введённый пароль правильный, выводится сообщение об успешном входе, иначе сообщение об ошибке.
 11. Проверка типов данных
Напишите программу, которая проверяет, является ли переменная списком, кортежем или строкой, используя оператор is.
 12. Минимум из двух чисел
Напишите программу, которая находит минимальное значение из двух введённых чисел с использованием тернарного оператора.
 13. Проверка времени суток
Напишите программу, которая проверяет введённое время (в формате 24 часа) и выводит соответствующее приветствие: “Доброе утро”, “Добрый день”, “Добрый вечер” или “Доброй ночи”.
 14. Магазин скидок
Напишите программу, которая проверяет, есть ли у пользователя промокод. Если да, то применяется скидка в 10%, иначе — полная цена.
 15. Логин и пароль
Напишите программу, которая проверяет введённые логин и пароль. Если они совпадают с ожидаемыми значениями, то выводится сообщение “Доступ разрешён”, иначе — “Неверный логин или пароль”.
